tutorial/programmer-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-27 Mon 19:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tutorial #1: Your First Project</title>
<meta name="author" content="Connor Redfern" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../doc-style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Tutorial #1: Your First Project</h1>
<p>
<a href="programmer-0.html">Prev</a> <a href="../index.html">Up</a> <a href="programmer-2.html">Next</a>
</p>


<div id="outline-container-org4d467bb" class="outline-2">
<h2 id="org4d467bb">A Project</h2>
<div class="outline-text-2" id="text-org4d467bb">
<p>
Now that we have the basics out of the way, it's time to create a new project! 
From the menu items at the top, click Project → New. You'll need to select (or
create) a directory for your project. 
</p>

<p>
By default, viper will create two new files:
</p>

<div class="org-src-container">
<pre class="src src-ascii">&lt;projname&gt;
┣━ &lt;projname&gt;.rls
┗━ src
   ┗━ main.rl 
</pre>
</div>
</div>

<div id="outline-container-org6a9a744" class="outline-3">
<h3 id="org6a9a744">Modules, Packages and Systems</h3>
<div class="outline-text-3" id="text-org6a9a744">
<p>
Typically, Relic code is organized into three levels: Modules, Packages and Systems.
</p>

<p>
If we look at the file 'main.rl', we can see the first level: Modules.
</p>

<div class="org-src-container">
<pre class="src src-relic"><span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">module</span> main
  <span style="color: #8abeb7;">(</span><span style="color: #b5bd68;">export</span> main<span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>

<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">def</span> main <span style="color: #b5bd68;">proc</span> <span style="color: #8abeb7;">[]</span>
  <span style="color: #8abeb7;">(</span>write-line <span style="color: #8abeb7;">"Hello from Relic!"</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>
</pre>
</div>

<p>
Modules can be nested inside each other, so you can have a module "geometry"
with an internal module "square", for example. Modules can in turn be collected
into packages. Unlike Modules, Packages cannot be nested inside each other. A
package is intended to represent a the code of a complete work, such as a
library or application.
</p>

<p>
Finally, there are systems. While modules and packages are built into the
language, systems are not. Instead, systems are used to build packages, so a
system is a description of how to build a package. Systems allow you to inject
compile-time parameters, such as whether a build is debug or release, or whether
to build a specific feature or use a specific library.
</p>

<p>
A system is defined in a "Relic System" file, with extension <code>.rls</code>. You can see
that 
</p>

<div class="org-src-container">
<pre class="src src-relic"><span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">def</span> &lt;projname&gt; system
  <span style="color: #de935f;">:package</span> <span style="color: #8abeb7;">"&lt;projname&gt;"</span>
  <span style="color: #de935f;">:dependencies</span> <span style="color: #8abeb7;">(</span>list <span style="color: #8abeb7;">"base"</span><span style="color: #8abeb7;">)</span>
  <span style="color: #de935f;">:src</span> <span style="color: #8abeb7;">"src"</span>
  <span style="color: #de935f;">:entry</span> <span style="color: #8abeb7;">"main/main"</span><span style="color: #c5c8c6;">)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgfb5e86d" class="outline-3">
<h3 id="orgfb5e86d">Conditionals</h3>
<div class="outline-text-3" id="text-orgfb5e86d">
<div class="org-src-container">
<pre class="src src-relic"><span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">if</span> <span style="color: #8abeb7;">(</span>&lt; <span style="color: #81a2be;">2</span> <span style="color: #81a2be;">3</span><span style="color: #8abeb7;">)</span>
  <span style="color: #8abeb7;">(</span>write-line <span style="color: #8abeb7;">"two is less than three"</span><span style="color: #8abeb7;">)</span>
  <span style="color: #8abeb7;">(</span>write-line <span style="color: #8abeb7;">"three is less than two??"</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>
</pre>
</div>
</div>
</div>



<div id="outline-container-org39e7efb" class="outline-3">
<h3 id="org39e7efb">Comparison</h3>
<div class="outline-text-3" id="text-org39e7efb">
</div>
<div id="outline-container-orgf5e7548" class="outline-4">
<h4 id="orgf5e7548">Exercise: FizzBuzz</h4>
<div class="outline-text-4" id="text-orgf5e7548">
<p>
Below is a code snippet you can copy into your 'main.rl' file to complete fizzbuzz.
</p>

<div class="org-src-container">
<pre class="src src-relic"><span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">module</span> main
  <span style="color: #8abeb7;">(</span><span style="color: #b5bd68;">import</span> core.parse<span style="color: #8abeb7;">)</span>
  <span style="color: #8abeb7;">(</span><span style="color: #b5bd68;">export</span> main<span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>

<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">def</span> main <span style="color: #b5bd68;">proc</span> <span style="color: #8abeb7;">[]</span>
  <span style="color: #8abeb7;">(</span><span style="color: #b5bd68;">let!</span> input <span style="color: #f0c674;">(</span>read-line<span style="color: #f0c674;">)</span><span style="color: #8abeb7;">)</span>
  <span style="color: #8abeb7;">(</span><span style="color: #b5bd68;">match</span> <span style="color: #f0c674;">(</span>run-parser lexing.num input<span style="color: #f0c674;">)</span>
    <span style="color: #f0c674;">(</span><span style="color: #de935f;">:ok</span> num -&gt; print <span style="color: #b5bd68;">(</span>fizz-buzz num<span style="color: #b5bd68;">)</span>
    <span style="color: #b5bd68;">(</span><span style="color: #de935f;">:err</span> err -&gt; print err<span style="color: #b5bd68;">)</span><span style="color: #f0c674;">)</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>

<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">def</span> fizz-buzz <span style="color: #b5bd68;">fn</span> <span style="color: #8abeb7;">[</span>num<span style="color: #8abeb7;">]</span>
  &lt;your code here&gt;<span style="color: #c5c8c6;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Connor Redfern</p>
<p class="date">Created: 2024-05-27 Mon 19:04</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
